[
    {
        "user": "Noah",
        "difficulty": 15,
        "questions": "<ul>\n    <li>In an ancient market, a trader sells spices in bundles of 7 and 13. If Noah wants to buy exactly 100 bundles, using only these two types, how many different combinations of 7-bundle and 13-bundle options are possible?</li>\n    <li>Noah is exploring a magical forest where each magical tree doubles in size every night. If a tree starts at 1 meter tall on day 0 and reaches 128 meters by a certain day, on which day does it reach 128 meters, and what was its height the day before?</li>\n    <li>In a distant galaxy, a spaceship can travel a distance covered by the Fibonacci sequence, where each number is the sum of the two preceding ones. If the spaceship travels the 10th Fibonacci distance on Monday and the 12th on Wednesday, what distance does it cover on Tuesday, and what is the total distance traveled from Monday to Wednesday?</li>\n</ul>",
        "timestamp": "2025-06-28 01:28:47"
    },
    {
        "user": "Noah",
        "difficulty": 15,
        "questions": "<ul>\n    <li>Noah is exploring a mysterious cave filled with numbered stones. Each stone has a number that is the sum of the two previous stones in the sequence, starting with the numbers 3 and 5. If he picks up the 10th stone, what number does it have?</li>\n    <li>Noah is reading about ancient mathematics and learns about the magic square, a 3x3 grid where the sum of numbers in each row, column, and diagonal is the same. If the magic constant is 15 and the grid starts with the top row as 8, 1, 6, what are the numbers in the bottom row of the grid?</li>\n    <li>Noah is building a mini roller coaster for his science project. The track forms a loop with a circumference of 18 meters. If Noah wants to place support beams every 1.5 meters along the loop, how many support beams does he need to ensure the entire loop is supported?</li>\n</ul>",
        "timestamp": "2025-06-28 01:40:50"
    },
    {
        "user": "Dylan",
        "difficulty": 11,
        "questions": "\n<ul>\n    <li>In a magical forest, there are trees that grow only in groups of 3. Each tree produces 7 golden apples. If Dylan collects apples from 5 groups of trees, how many golden apples does he have in total?</li>\n    <li>Dylan is helping to set up a treasure hunt. He needs to place clues at different locations. If there are 4 treasure boxes, and each box has 3 unique clues, how many different clues does Dylan need to prepare in total?</li>\n    <li>Dylan is creating a pattern using colored beads. He uses 2 red beads, followed by 3 blue beads, and then 4 green beads. If he repeats this pattern 3 times, how many beads has he used in total?</li>\n</ul>\n",
        "timestamp": "2025-06-28 01:54:11"
    },
    {
        "user": "Dylan",
        "difficulty": 12,
        "questions": "\n<ul>\n    <li>In a magical forest, there are 3 types of trees: Apple trees, Banana trees, and Coconut trees. The number of Apple trees is twice the number of Banana trees, and the number of Coconut trees is 5 more than the number of Banana trees. If there are 25 Coconut trees, how many Apple trees are there?</li>\n    <li>In a distant kingdom, a dragon can fly 4 miles in 10 minutes. If the dragon starts flying at 8:00 AM and continues flying at the same speed without stopping, what time will it be when the dragon has flown 60 miles?</li>\n    <li>On a treasure island, there are 3 hidden chests. The first chest has 15 gold coins, the second chest has 10 gold coins, and the third chest is empty. If you can move coins between chests, find a way to have exactly 8 coins in each chest. How many coins must you move, and from which chest to which chest?</li>\n</ul>\n",
        "timestamp": "2025-06-28 19:13:49"
    },
    {
        "user": "Noah",
        "difficulty": 10,
        "questions": "\n<ul>\n    <li>\n        In a magical forest, each tree has either 4 or 5 branches. If there are 12 trees with a total of 53 branches, how many trees have 4 branches?\n    </li>\n    <li>\n        A group of explorers is searching for treasure. They find a map that says the treasure is buried 7 meters north and 24 meters east from their current location. How far do they need to walk in a straight line to reach the treasure?\n    </li>\n    <li>\n        A family of rabbits doubles in number every month. If there are currently 3 rabbits, how many months will it take for the family to exceed 100 rabbits?\n    </li>\n</ul>\n",
        "timestamp": "2025-06-28 19:24:24"
    },
    {
        "user": "Noah",
        "difficulty": 9,
        "questions": "\n<ul>\n    <li>In a magical garden, there are 12 rows of flowers, and each row has 5 more flowers than the previous one. If the first row has 8 flowers, how many flowers are there in total in the garden?</li>\n    <li>Imagine a local bakery where every Monday they bake twice as many muffins as the previous day. If they start with 10 muffins on Saturday, how many muffins do they bake on the following Monday?</li>\n    <li>In a race, three friends, Alice, Ben, and Charlie, run at different speeds. Alice finishes 1 minute before Ben, and Ben finishes 2 minutes before Charlie. If Charlie finishes the race in 15 minutes, how long did it take Alice to finish?</li>\n</ul>\n",
        "timestamp": "2025-06-28 19:25:14"
    },
    {
        "user": "Noah",
        "difficulty": 11,
        "questions": "\n<ul>\n    <li>In ancient Egypt, a pyramid has a square base with each side measuring 120 meters. If each layer of the pyramid is 1 meter high and the pyramid is 50 meters tall, how many layers are there in total?</li>\n    <li>Noah is solving a puzzle where he needs to arrange numbers from 1 to 9 in a 3x3 grid so that each row, column, and diagonal adds up to the same number. What is this number?</li>\n    <li>Noah sets out to build a small bridge using blocks. He uses 3 blocks for the first section, 5 blocks for the second section, 7 blocks for the third section, and so on, increasing by 2 blocks each time. How many blocks will Noah need for the fifth section?</li>\n</ul>\n",
        "timestamp": "2025-06-28 19:27:37"
    },
    {
        "user": "Noah",
        "difficulty": 12,
        "questions": "\n<ul>\n    <li>In the ancient city of Timbuktu, a merchant has 3 bags of magical beans. Each bag contains 7 red beans, 9 blue beans, and an unknown number of green beans. If there are 60 beans in total across all bags, how many green beans are there in each bag?</li>\n    <li>In a small village in Japan, a festival is held where each participant wears a unique mask. If there are 15 characters and each character has 5 different mask designs, but only 2 designs are used per character during the festival, how many different mask combinations are possible for the entire festival?</li>\n    <li>The pyramids of Giza cast long shadows during the summer solstice. If the height of a pyramid is 146 meters and its shadow is twice its height, calculate the angle of elevation of the sun at that moment.</li>\n</ul>\n",
        "timestamp": "2025-06-28 19:27:45"
    },
    {
        "user": "Noah",
        "difficulty": 13,
        "questions": "<ul>\n  <li>In a magical forest, there are 3 types of trees: oak, birch, and maple. For every 2 oak trees, there are 3 birch trees, and for every 3 birch trees, there are 4 maple trees. If there are 36 maple trees, how many oak trees are there?</li>\n  <li>Noah is creating a mosaic using square tiles. He arranges the tiles in a rectangular grid that has 4 more rows than it does columns. If the total number of tiles used is 72, how many columns are in the grid?</li>\n  <li>A treasure map shows a path that includes 5 straight lines. The first line is 10 meters, the second is twice as long as the first, the third is 5 meters shorter than the second, the fourth is twice the length of the first, and the fifth is as long as the first and second combined. What is the total length of the path?</li>\n</ul>",
        "timestamp": "2025-06-28 19:27:53"
    },
    {
        "user": "Noah",
        "difficulty": 14,
        "questions": "\n<ul>\n    <li>In an ancient puzzle from China, there is a farmer who owns 5 geese and 3 pigs. Each goose lays 2 eggs every day, while each pig can find 5 truffles every week. If the farmer sells each egg for $0.50 and each truffle for $2, how much money does the farmer make in 2 weeks?</li>\n    <li>In the bustling markets of Istanbul, a merchant sells silk scarves. If each scarf costs $15 and he gives a 10% discount to every third customer, how much revenue does he make if 24 customers buy scarves?</li>\n    <li>In the rainforest, a scientist is studying a group of monkeys. Every 5 minutes, one monkey claps its hands 7 times. If there are 6 monkeys and the scientist observes them for an hour, how many claps does she hear in total?</li>\n</ul>\n",
        "timestamp": "2025-06-28 19:28:02"
    },
    {
        "user": "Noah",
        "difficulty": 15,
        "questions": "\n<ul>\n    <li>In a distant land, there are two magical wells. One well doubles the number of pebbles you have when you drop one in, and the other well triples them. If Noah starts with 3 pebbles and uses each well once, what is the maximum number of pebbles he can have?</li>\n    <li>Noah is designing a garden in the shape of a perfect square. He wants to plant a different type of flower in each square meter of his garden. If he ends up using 64 different types of flowers, how long is each side of the garden?</li>\n    <li>Noah's class is going on a field trip to the zoo. There are 120 students, and they need to be divided equally into buses, with each bus holding exactly 15 students. How many buses are needed, and if one bus breaks down, how many students will be left without a bus?</li>\n</ul>\n",
        "timestamp": "2025-06-28 19:28:13"
    },
    {
        "user": "default_user",
        "difficulty": 10,
        "questions": "\n<ul>\n    <li>In the ancient city of Babylon, people used a number system based on 60 instead of 10. If a Babylonian merchant had 2 baskets of apples, with 30 apples in each basket, how many more apples would he need to have a total that matches the base-60 value of 90?</li>\n    <li>A puzzle from Japan involves a grid with numbers. In a 3x3 square, fill in each cell with a number from 1 to 9 such that each row, column, and diagonal adds up to 15. What number should be placed in the center if the top row reads 8, 1, and 6?</li>\n    <li>In a small village in India, a farmer has a magical cow that produces double the amount of milk every day. If the cow produces 1 liter of milk on the first day, how many liters of milk will it produce on the 5th day?</li>\n</ul>\n",
        "timestamp": "2025-06-28 21:48:07"
    },
    {
        "user": "Guest",
        "difficulty": 10,
        "questions": "\n<ul>\n    <li>In a magical forest, every tree has 3 branches, and each branch has 5 apples. If there are 12 trees in the forest, how many apples are there in total?</li>\n    <li>Noah is baking cookies, and each batch requires 2 cups of flour. If Noah wants to bake 15 batches, but he only has a 20-cup bag of flour, how many more cups of flour does he need?</li>\n    <li>During a festival, Dylan noticed that every 4th person entering the gate received a balloon, and every 7th person received a sticker. If 100 people entered the gate, how many received both a balloon and a sticker?</li>\n</ul>\n",
        "timestamp": "2025-06-28 22:03:26"
    },
    {
        "user": "Guest",
        "difficulty": 10,
        "questions": "<ul>\n    <li>In the ancient city of Babylon, a trader has a magical camel that can carry twice the weight of a normal camel. If a normal camel can carry 250 kilograms, how much weight can the magical camel carry when transporting 5 golden statues, each weighing 30 kilograms?</li>\n    <li>A farmer in Egypt wants to plant a rectangular field with papyrus plants. If the field's length is 20 meters and the width is 15 meters, how many meters of fencing will the farmer need to enclose the entire field?</li>\n    <li>In a bustling market in Morocco, a merchant has 45 colorful rugs. If he arranges them in rows with 5 rugs in each row, how many rows of rugs will he be able to display, and how many rugs will he have left over?</li>\n</ul>",
        "timestamp": "2025-06-28 22:03:30"
    },
    {
        "user": "Noah",
        "difficulty": 15,
        "questions": "\n<ul>\n    <li>In an ancient village, the villagers use a unique calendar system where each year consists of 9 months, and each month has 33 days. If today is the 10th day of the 5th month in the year 120, what day of the week will it be exactly 1,000 days from now?</li>\n    <li>Noah is designing a garden with a triangular shape. He has three types of fences: red, blue, and green. The length of the red fence is twice the length of the blue fence, and the green fence is 3 meters longer than the blue fence. If the perimeter of the garden is 57 meters, how long is each fence?</li>\n    <li>In a distant land, there is a magical river that flows in a pattern: for every 2 hours it flows north, it flows 1 hour south, and then rests for 1 hour. If the river starts flowing north at midnight, how many kilometers north will the water have flowed by 6 PM, given that the river flows at a speed of 4 kilometers per hour?</li>\n</ul>\n",
        "timestamp": "2025-06-28 22:09:01"
    },
    {
        "user": "Dylan",
        "difficulty": 13,
        "questions": "\n<ul>\n    <li>In a magical garden, there are 7 rows of trees, and each row has the same number of trees. If there are a total of 56 trees, how many trees are there in each row?</li>\n    <li>Imagine you are an explorer on a treasure hunt. You come across a chest with 5 locks, and you have 8 keys. If each lock needs a different key, how many different combinations of keys can unlock all the locks?</li>\n    <li>In a fairytale land, there are 9 rainbow bridges, and each bridge can be crossed in 2 ways: walking or skipping. How many different ways can you cross all the bridges if you must cross each one once?</li>\n</ul>\n",
        "timestamp": "2025-06-28 22:50:14"
    },
    {
        "user": "Noah",
        "difficulty": 16,
        "questions": "\n<ul>\n    <li>In a magic square, the sum of numbers in each row, column, and diagonal is always the same. If you have a 3x3 magic square where the center number is 5, and the sum of each line is 15, what are the other numbers in the square?</li>\n    <li>Imagine a train that leaves Station A traveling at 60 km/h towards Station B. At the same time, a second train leaves Station B heading towards Station A at 40 km/h. If the distance between the two stations is 300 km, after how many hours will the two trains meet?</li>\n    <li>In a distant land, the currency is based on two coins: the Blip and the Blop. If 3 Blips are worth the same as 2 Blops, and together they sum up to 30 Blips, how many Blops are there?</li>\n</ul>\n",
        "timestamp": "2025-06-28 22:51:41"
    },
    {
        "user": "Dylan",
        "difficulty": 11,
        "questions": "\n<ul>\n    <li>In the bustling market of Marrakech, a merchant has 24 colorful carpets. If he wants to arrange them in equal stacks with more than one carpet in each stack, how many different ways can he arrange the carpets?</li>\n    <li>In the magical forests of Finland, forest gnomes are planting enchanted flowers. Each gnome can plant 6 flowers in an hour. If there are 5 gnomes working together, how many flowers can they plant in 3 hours?</li>\n    <li>At a traditional Japanese festival, there are 12 lanterns hanging in a row. Every third lantern is red, starting from the first one. How many of the lanterns are red?</li>\n</ul>\n",
        "timestamp": "2025-06-29 00:14:51"
    }
]